rpm_extracts/python3-cherrypy/pyc_decompiled/benchmark.cpython-39.py.decompiled.txt
Z d9d!d"
Z!d:d$d%
Z"e#d&k
Z$z(e
j%d(d
Z&Z'e(e&
d*e)v
d+e)v
e)d+
d,e)v
d-d.
d/d.
Z-e+d0
d1d2
d2e.
Z/e/
Z1d3e)v
nFd4e)v
e"d5d6
n0d7e)v
j2_3e
j2_4e
CherryPy Benchmark Tool
    Usage:
        benchmark.py [options]
    --null:        use a null Request object (to bench the HTTP server only)
    --notests:     start the server but do not run the tests; this allows
                   you to check the tested pages with a browser
    --help:        show this help message
    --cpmodpy:     run tests via apache on 54583 (with the builtin _cpmodpy)
    --modpython:   run tests via apache on 54583 (with modpython_gateway)
    --ab=path:     Use the ab script/executable at 'path' (see below)
    --apache=path: Use the apache script/exe at 'path' (see below)
    To run the benchmarks, the Apache Benchmark tool "ab" must either be on
    your system path, or specified via the --ab=path option.
    To run the modpython tests, the "apache" executable or script must be
    on your system path, or provided via the --apache=path option. On some
    platforms, "apache" may be called "apachectl" or "apache2ctl"--create
    a symlink to them if needed.
_cperror
_cpmodpy)
httputil
apachez
/cpbench/users/rdelon/apps/blog)
	ABSession
Root
print_report
run_standard_benchmarks
safe_threads
size_report
thread_reportc
<html>
<head>
    <title>CherryPy Benchmark</title>
</head>
<body>
    <ul>
        <li><a href="hello">Hello, world! (14 byte dynamic)</a></li>
        <li><a href="static/index.html">Static file (14 bytes static)</a></li>
        <li><form action="sizer">Response of length:
            <input type='text' name='size' value='10' /></form>
        </li>
    </ul>
</body>
</html>
selfr
;/usr/lib/python3.9/site-packages/cherrypy/test/benchmark.py
index3
Root.indexc
Hello, world
helloD
Root.helloc
size_cache
int)
sizeZ
respr
sizerH
Root.sizerN)
__name__
__module__
__qualname__
cherrypyZ
exposer
productionz	127.0.0.1
log.error.fileZ
environmentz
server.socket_hostz
server.socket_portz
server.max_request_header_sizez
server.max_request_body_sizez
tools.log_tracebacks.onz
tools.log_headers.onz
tools.trailing_slash.onz
/staticTZ
static)
tools.staticdir.onz
tools.staticdir.dirz
tools.staticdir.root)
app)	r
config
update
curdir
globalsZ
treeZ
mountr
SCRIPT_NAME)
appconfr
initP
NullRequestz;A null HTTP request class, returning 200 and an empty body.
httpc
localZ
remote
schemer
__init__p
NullRequest.__init__c
closes
NullRequest.closec
200 OK)
Content-Typez	text/html)
Serverz
Null CherryPyZ
Date)
Content-Length
responseZ
statusr
HTTPDateZ
header_list
body)
method
pathZ
query_stringZ
protocolZ
headersZ
rfiler
runv
NullRequest.runN)
__doc__r'
NullResponseN)
A session of 'ab', the Apache HTTP server benchmarking tool.
Example output from ab:
This is ApacheBench, Version 2.0.40-dev <$Revision: 1.121.2.1 $> apache-2.0
Copyright (c) 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Copyright (c) 1998-2002 The Apache Software Foundation, http://www.apache.org/
Benchmarking 127.0.0.1 (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Completed 600 requests
Completed 700 requests
Completed 800 requests
Completed 900 requests
Server Software:        CherryPy/3.1beta
Server Hostname:        127.0.0.1
Server Port:            54583
Document Path:          /static/index.html
Document Length:        14 bytes
Concurrency Level:      10
Time taken for tests:   9.643867 seconds
Complete requests:      1000
Failed requests:        0
Write errors:           0
Total transferred:      189000 bytes
HTML transferred:       14000 bytes
Requests per second:    103.69 [#/sec] (mean)
Time per request:       96.439 [ms] (mean)
Time per request:       9.644 [ms] (mean, across all concurrent requests)
Transfer rate:          19.08 [Kbytes/sec] received
Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   2.9      0      10
Processing:    20   94   7.3     90     130
Waiting:        0   43  28.1     40     100
Total:         20   95   7.3    100     130
Percentage of the requests served within a certain time (ms)
  50%    100
  66%    100
  75%    100
  80%    100
  90%    100
  95%    100
  98%    100
  99%    110
 100%    130 (longest request)
Finished 1000 requests
complete_requestsZ	Completeds
^Complete requests:\s*(\d+))
failed_requestsZ
Faileds
^Failed requests:\s*(\d+))
requests_per_secondz
req/secs!
^Requests per second:\s*([0-9.]+))
time_per_request_concurrentz
msec/reqs6
^Time per request:\s*([0-9.]+).*concurrent requests\)$)
transfer_ratez
KB/secs
^Transfer rate:\s*([0-9.]+)
/hello
requests
concurrency)
ABSession.__init__c
z$-k -n %s -c %s http://127.0.0.1:%s%s)
server
socket_portr4
portr
args
ABSession.argsc
read_process
AB_PATHr8
output
	Exception
printr
format_exc
parse_patterns
search
	MULTILINE
group
setattr)
attr
name
pattern
valr
ABSession.runN)	r
win32)
}	|	d
rzt	|
threadsZ
Averagec
.0rF
avgr4
<listcomp>
z!thread_report.<locals>.<listcomp>)
list
zipr@
dict
fromkeysr4
getattrr>
float
append)
sess
attrs
names
patterns
rowrF
bytesz
%s/sizer?size=%sc
size_report.<locals>.<listcomp>)
sizesr4
 | )
stdout
writerQ
rjust)
rowsrd
zOClient Thread Report (1000 requests, 14 byte response body, %s server threads):zPClient Thread Report (1000 requests, 14 bytes via staticdir, %s server threads):z
%s/static/index.htmlzBSize Report (1000 requests, 50 client threads, %s server threads):)
thread_poolr
zMStart the CherryPy app server in 'serverless' mode (for modpython/WSGI).
    
nullreqr9
engine
stateZ	_cpengineZ
STOPPEDZ
get_optionsr#
request_classr/
response_classr
startZ
STARTING
wait)
reqZ
ab_optr
startup_modpython6
Starting mod_python...
--null)
--abr9
wsgi.applicationz
cherrypy::tree)
wsgi.startup
*cherrypy.test.benchmark::startup_modpythonz
modpython_gateway::handlerr
opts
apache_path
handler)
cherrypy.setuprv
)	r>
ModPythonServer
APACHE_PATHrq
stop)
use_wsgiZ
pyopts
run_modpythonH
__main__)
cpmodpyZ	modpythonZ
nullZ
notests
helpz
ab=z
apache=r:
--helpru
z	--notestsc
Nz'You may now open http://127.0.0.1:%s%s/rt
Using null Request object)
Started in %s secondsrt
Using null Request object)
timerq
exit)
endr
Starting CherryPy app server...c
NullWriterz)Suppresses the printing of socket errors.c
datar
NullWriter.writeN)
z	--cpmodpyz
--modpythonT)
F)8r.
getopt
osrA
cherrypy.libr
join
getcwd
dirname
__file__r
__all__r
platformr
longopts
argvZ
switchesr8
GetoptErrorr>
objectr
stderrrq
start_with_callback
blockr
<module>